#Lecture -> 2

#LOAD DATASET FROM COMMA SEPARATED VALUE(CSV) INTO DATAFRAME

#Let's first use pandas to load a car_sales data to a dataframe using  read_csv.

In [3]:
import pandas as pd
df = pd.read_csv('car_sales.csv')
df

   Serial No         Car Model  Year  Units Sold  Price per Unit
0          1      Toyota Camry  2022         150           24000
1          2       Honda Civic  2021         180           22000
2          3        Ford F-150  2023         120           35000
3          4  Chevrolet Malibu  2022          90           26000
4          5     Tesla Model 3  2023         200           40000

In [2]:
#We can set the serial no as the index using index_col
df = pd.read_csv('car_sales.csv',index_col=0)
df

                  Car Model  Year  Units Sold  Price per Unit
Serial No
1              Toyota Camry  2022         150           24000
2               Honda Civic  2021         180           22000
3                Ford F-150  2023         120           35000
4          Chevrolet Malibu  2022          90           26000
5             Tesla Model 3  2023         200           40000

In [4]:
#I think we can change Price per unit to PPU (AS AN ABBREVIATION)
#Let's first looks at columns of df
df.columns

Index(['Serial No', 'Car Model', 'Year', 'Units Sold', 'Price per Unit'], dtype='object')

In [5]:
#Let's change Price per Unit To PPU
new_df = df.rename(columns={"Price per Unit":"PPU"})
new_df

   Serial No         Car Model  Year  Units Sold    PPU
0          1      Toyota Camry  2022         150  24000
1          2       Honda Civic  2021         180  22000
2          3        Ford F-150  2023         120  35000
3          4  Chevrolet Malibu  2022          90  26000
4          5     Tesla Model 3  2023         200  40000

In [14]:
#Let's change all uppercase columns names to lowercase
cols = list(df.columns)
for i in range(0,len(cols)):
    cols[i] = cols[i].lower()
cols

['serial no', 'car model', 'year', 'units sold', 'price per unit']

In [15]:
df.columns = cols
df

   serial no         car model  year  units sold  price per unit
0          1      Toyota Camry  2022         150           24000
1          2       Honda Civic  2021         180           22000
2          3        Ford F-150  2023         120           35000
3          4  Chevrolet Malibu  2022          90           26000
4          5     Tesla Model 3  2023         200           40000

#QUERYING THE DATAFRAME

First We should understand about boolean masking. It is the heart of efficient and fast querying in pandas and numpy.

Q) What Is Boolean Mask?
Ans -> A Boolean mask is an array which can be thought of as a one dimension like a series, or two-dimensions like a DataFrame, where each of the values of the array are either true or false. This array is essentially overlaid on top of the other data structure that we're querying, and any cell aligned with the true value will be admitted into our final result, and any cell aligned with the false value will not.

Boolean Masks can be created by applying operators directly to the pandas series or dataframe object.
For ex -> We are only interested in seeing cars which are sold more than 130 times.

In [16]:
df.columns

Index(['serial no', 'car model', 'year', 'units sold', 'price per unit'], dtype='object')

In [18]:
selling_mask = df['units sold']>130
selling_mask

0     True
1     True
2    False
3    False
4     True
Name: units sold, dtype: bool

Let's apply this on top of our data

In [19]:
df.where(selling_mask).head()

   serial no      car model    year  units sold  price per unit
0        1.0   Toyota Camry  2022.0       150.0         24000.0
1        2.0    Honda Civic  2021.0       180.0         22000.0
2        NaN            NaN     NaN         NaN             NaN
3        NaN            NaN     NaN         NaN             NaN
4        5.0  Tesla Model 3  2023.0       200.0         40000.0

In [20]:
df

   serial no         car model  year  units sold  price per unit
0          1      Toyota Camry  2022         150           24000
1          2       Honda Civic  2021         180           22000
2          3        Ford F-150  2023         120           35000
3          4  Chevrolet Malibu  2022          90           26000
4          5     Tesla Model 3  2023         200           40000

In [21]:
#Next Step is to delete NaN rows which don't satisfy our criteria using dropna function
df.where(selling_mask).dropna()

   serial no      car model    year  units sold  price per unit
0        1.0   Toyota Camry  2022.0       150.0         24000.0
1        2.0    Honda Civic  2021.0       180.0         22000.0
4        5.0  Tesla Model 3  2023.0       200.0         40000.0

In [22]:
#Pandas gives us another way in which we can combine where and dropna
df[selling_mask]

   serial no      car model  year  units sold  price per unit
0          1   Toyota Camry  2022         150           24000
1          2    Honda Civic  2021         180           22000
4          5  Tesla Model 3  2023         200           40000

In [24]:
#We can also display a single column using indexing operator
df['car model']

0        Toyota Camry
1         Honda Civic
2          Ford F-150
3    Chevrolet Malibu
4       Tesla Model 3
Name: car model, dtype: object

In [25]:
#We can view multiple columns by passing a list of column names
df[['price per unit','year']]

   price per unit  year
0           24000  2022
1           22000  2021
2           35000  2023
3           26000  2022
4           40000  2023

In [27]:
#Let's see which car are available under 25000
affordability_mask = df['price per unit']>25000
df[affordability_mask]

   serial no         car model  year  units sold  price per unit
2          3        Ford F-150  2023         120           35000
3          4  Chevrolet Malibu  2022          90           26000
4          5     Tesla Model 3  2023         200           40000

In [28]:
#For applying multiple boolean masks we can use &
selling_mask&affordability_mask

0    False
1    False
2    False
3    False
4     True
dtype: bool

You can also use gt and lt for less than greater than

In [ ]:
df

In [30]:
df['price per unit'].gt(2000000).lt(30000)

0    True
1    True
2    True
3    True
4    True
Name: price per unit, dtype: bool

#Indexing DATAFRAMES

In [31]:
df['Customer Rating']=["Good","Best","Good","Okay","Okay"]
df

,serial no,car model,year,units sold,price per unit,Customer Rating
0,1,Toyota Camry,2022,150,24000,Good
1,2,Honda Civic,2021,180,22000,Best
2,3,Ford F-150,2023,120,35000,Good
3,4,Chevrolet Malibu,2022,90,26000,Okay
4,5,Tesla Model 3,2023,200,40000,Okay

In [32]:
#If you want to change indexing columns to customer rating we will do it in two steps.
#1)Copy indexed data to its own column
df['Serial Number']=df.index
#2)Set Index using set_index
df=df.set_index('Customer Rating')
df

,serial no,car model,year,units sold,price per unit,Serial Number
Customer Rating,,,,,,
Good,1,Toyota Camry,2022,150,24000,0
Best,2,Honda Civic,2021,180,22000,1
Good,3,Ford F-150,2023,120,35000,2
Okay,4,Chevrolet Malibu,2022,90,26000,3
Okay,5,Tesla Model 3,2023,200,40000,4

In [33]:
#We can get rid of index completely using reset_index
df = df.reset_index()
df

,Customer Rating,serial no,car model,year,units sold,price per unit,Serial Number
0,Good,1,Toyota Camry,2022,150,24000,0
1,Best,2,Honda Civic,2021,180,22000,1
2,Good,3,Ford F-150,2023,120,35000,2
3,Okay,4,Chevrolet Malibu,2022,90,26000,3
4,Okay,5,Tesla Model 3,2023,200,40000,4

Let's study about multi-level indexing for that we need to work with some new data like population.

In [34]:
population_data = pd.read_csv('indian_cities_population.csv')
population_data

,City,Population,Total Male,Total Female,Male Percentage,Female Percentage,Region
0,Delhi,33807403,17567000,16240403,52.3,47.7,North
1,Mumbai,21673149,10845000,10828149,50.1,49.9,West
2,Bangalore,14008262,7200000,6808262,51.4,48.6,South
3,Chennai,12053697,6100000,5953697,50.6,49.4,South
4,Hyderabad,11068877,5600000,5468877,50.7,49.3,South

In [35]:
#We can use unique to check for diff values that exist in a column
population_data['Region'].unique()

array(['North', 'West', 'South'], dtype=object)

In [36]:
#Let's look for data in which male and females are almost equal say 51 and 49
equality_mask = population_data['Female Percentage']>49.0
new_data=population_data[equality_mask]
new_data

,City,Population,Total Male,Total Female,Male Percentage,Female Percentage,Region
1,Mumbai,21673149,10845000,10828149,50.1,49.9,West
3,Chennai,12053697,6100000,5953697,50.6,49.4,South
4,Hyderabad,11068877,5600000,5468877,50.7,49.3,South

In [37]:
#Now if we want the data of just a few columns
wanted_columns = ["City","Region","Population"]
wanted_data = population_data[wanted_columns]
wanted_data

        City Region  Population
0      Delhi  North    33807403
1     Mumbai   West    21673149
2  Bangalore  South    14008262
3    Chennai  South    12053697
4  Hyderabad  South    11068877

In [38]:
#Now let's set city and region as index
multi = wanted_data.set_index(['City','Region'])
multi

                  Population
City      Region
Delhi     North     33807403
Mumbai    West      21673149
Bangalore South     14008262
Chennai   South     12053697
Hyderabad South     11068877

In [44]:
#You need to pass two indexes first is first index and second id second one.
multi.loc[('Delhi','North')]

Population    33807403
Name: (Delhi, North), dtype: int64

#END OF DATAFRAME PART - 2